fio_test_res2_read/64_1k.txt
test: (g=0): rw=randread, bs=(R) 1024B-1024B, (W) 1024B-1024B, (T) 1024B-1024B, ioengine=spdk, iodepth=64
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=83651: Thu Aug 14 19:22:02 2025
  read: IOPS=398k, BW=389MiB/s (408MB/s)(3889MiB/10001msec)
    slat (nsec): min=147, max=91003, avg=163.18, stdev=263.01
    clat (usec): min=17, max=9427, avg=159.98, stdev=110.24
     lat (usec): min=17, max=9427, avg=160.14, stdev=110.24
    clat percentiles (usec):
     |  1.00th=[   56],  5.00th=[   67], 10.00th=[   76], 20.00th=[   91],
     | 30.00th=[  106], 40.00th=[  120], 50.00th=[  135], 60.00th=[  157],
     | 70.00th=[  178], 80.00th=[  210], 90.00th=[  269], 95.00th=[  330],
     | 99.00th=[  478], 99.50th=[  553], 99.90th=[  930], 99.95th=[ 2114],
     | 99.99th=[ 3163]
   bw (  KiB/s): min=390584, max=400310, per=100.00%, avg=398242.80, stdev=2452.05, samples=20
   iops        : min=390584, max=400310, avg=398242.60, stdev=2452.10, samples=20
  lat (usec)   : 20=0.01%, 50=0.14%, 100=25.59%, 250=61.59%, 500=11.88%
  lat (usec)   : 750=0.65%, 1000=0.05%
  lat (msec)   : 2=0.04%, 4=0.05%, 10=0.01%
  cpu          : usr=99.97%, sys=0.01%, ctx=5, majf=0, minf=2
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=3982428,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=389MiB/s (408MB/s), 389MiB/s-389MiB/s (408MB/s-408MB/s), io=3889MiB (4078MB), run=10001-10001msec