fio_test_res2_read/64_512b.txt
test: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=spdk, iodepth=64
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=82825: Thu Aug 14 19:21:49 2025
  read: IOPS=398k, BW=195MiB/s (204MB/s)(1946MiB/10001msec)
    slat (nsec): min=147, max=275839, avg=161.30, stdev=263.39
    clat (usec): min=17, max=8764, avg=159.77, stdev=108.22
     lat (usec): min=17, max=8764, avg=159.93, stdev=108.22
    clat percentiles (usec):
     |  1.00th=[   56],  5.00th=[   67], 10.00th=[   76], 20.00th=[   91],
     | 30.00th=[  106], 40.00th=[  120], 50.00th=[  135], 60.00th=[  157],
     | 70.00th=[  178], 80.00th=[  210], 90.00th=[  269], 95.00th=[  330],
     | 99.00th=[  478], 99.50th=[  545], 99.90th=[  889], 99.95th=[ 1958],
     | 99.99th=[ 3097]
   bw (  KiB/s): min=191146, max=200487, per=100.00%, avg=199253.85, stdev=1983.15, samples=20
   iops        : min=382292, max=400974, avg=398507.60, stdev=3966.29, samples=20
  lat (usec)   : 20=0.01%, 50=0.13%, 100=25.65%, 250=61.55%, 500=11.88%
  lat (usec)   : 750=0.65%, 1000=0.05%
  lat (msec)   : 2=0.04%, 4=0.05%, 10=0.01%
  cpu          : usr=99.80%, sys=0.18%, ctx=17, majf=0, minf=3
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=3985078,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=195MiB/s (204MB/s), 195MiB/s-195MiB/s (204MB/s-204MB/s), io=1946MiB (2040MB), run=10001-10001msec