fio_test_res2_read/64_512k.txt
test: (g=0): rw=randread, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=spdk, iodepth=64
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=89549: Thu Aug 14 19:23:26 2025
  read: IOPS=4342, BW=2171MiB/s (2276MB/s)(21.2GiB/10014msec)
    slat (nsec): min=1560, max=12789, avg=2318.91, stdev=653.60
    clat (usec): min=895, max=28643, avg=14733.31, stdev=3540.31
     lat (usec): min=897, max=28645, avg=14735.63, stdev=3540.34
    clat percentiles (usec):
     |  1.00th=[ 3785],  5.00th=[ 6849], 10.00th=[ 8979], 20.00th=[12780],
     | 30.00th=[14353], 40.00th=[15139], 50.00th=[15664], 60.00th=[16188],
     | 70.00th=[16712], 80.00th=[17433], 90.00th=[18220], 95.00th=[18744],
     | 99.00th=[19792], 99.50th=[20055], 99.90th=[21103], 99.95th=[24249],
     | 99.99th=[27395]
   bw (  MiB/s): min=   63, max= 2195, per=95.37%, avg=2070.52, stdev=460.16, samples=21
   iops        : min=  126, max= 4390, avg=4141.05, stdev=920.32, samples=21
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.09%, 4=1.15%, 10=11.24%, 20=86.91%, 50=0.60%
  cpu          : usr=99.97%, sys=0.01%, ctx=4, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=43481,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=2171MiB/s (2276MB/s), 2171MiB/s-2171MiB/s (2276MB/s-2276MB/s), io=21.2GiB (22.8GB), run=10014-10014msec